# [config.py] - 싹쓸이 모드 전용 설정
KEYWORD_RULES = {
    "01_중요문서": ["신분증", "계약서", "등록증", "확인서", "통지서", "등본", "신고필증", "검진", "영수증", "명세서", "증명원", "증명서", "인감", "주민등록", "운전면허", "여권", "건강보험", "국세", "지방세", "세금", "보험", "공과", "청구서", "청첩장", "통장", "카드", "영수증", "세금", "청구서", "정부", "공공기관", "행정", "법원", "검찰", "경찰", "소송", "판결", "증인"],
    "02_AI_생성": ["ChatGPT", "Gemini", "DALL-E", "Generated", "AI"],
    "03_업무_프로젝트": ["GECKO", "공공근로", "팸플릿", "포스터", "poster", "사업자"],
    "04_메신저": ["KakaoTalk", "LINE", "카톡", "라인"],
    "05_금융_법률": ["은행", "복권", "행정소송", "법", "전세", "보험"]
}

EXTENSION_RULES = {
    "07_압축_실행파일": [".zip", ".rar", ".7z", ".exe", ".msi", ".tar", ".gz"],
    "08_일반_문서[PDF]": [".pdf"],
    "09_일반_문서[텍스트]": [".txt"],
    "10_일반_문서[MA-Office]": [".docx", ".doc", ".xlsx", ".xls", ".CSV", ".pptx", ".ppt"],
    "11_일반_문서[한컴]": [".hwp", ".hwpx"],
    "12_프로그램파일[C 언어]": [ ".h", ".c", ".cpp", ".cs"],
    "13_프로그램파일[HTML 관련]": [".html", ".css", ".js", ".php", ".json", ".xml"],
    "14_프로그램파일[파이썬 등]": [".py", ".ipynb"],
    "15_프로그램파일[기타]": [".java", ".class", ".sql", ".yaml", ".yml", ".md"],
    "16_시스템파일": [".ini", ".dll", ".msg"],
    "17_실행파일": [".exe", ".bat", ".ps1", ".msix"],
    "18_쓰레기파일": [".bak"]
}

IMAGE_EXTENSIONS = [".jpg", ".jpeg", ".png", ".gif", ".bmp", ".heic"]
VIDEO_EXTENSIONS = [".mp4", ".mkv", ".avi", ".mov", ".wmv"]

KEYWORD_RULES_IMP_DOC = ["신분증", "계약서", "등록증", "확인서", "통지서", "등본", "신고필증", "검진", "영수증", "명세서", "증명원", "증명서", "인감", "주민등록", "운전면허", "여권", "건강보험", "국세", "지방세", "세금", "보험", "공과", "청구서", "청첩장", "통장", "카드", "영수증", "세금", "청구서", "정부", "공공기관", "행정", "법원", "검찰", "경찰", "소송", "판결", "증인"]
KEYWORD_RULES_AI = ["ChatGPT", "Gemini", "DALL-E", "Generated", "AI"]
KEYWORD_RULES_MESSEGER = ["KakaoTalk", "LINE", "카톡", "라인"]